yicheng55/esp-idf-davicom/examples/ethernet/dm9058_ptp/sdkconfig.defaults
# CONFIG_IDF_TARGET="esp32p4"
CONFIG_IDF_TARGET="esp32s3"
# CONFIG_IDF_TARGET="esp32c6"

#
# ESP NETIF Adapter
#
CONFIG_ESP_NETIF_IP_LOST_TIMER_INTERVAL=120
# CONFIG_ESP_NETIF_PROVIDE_CUSTOM_IMPLEMENTATION is not set
CONFIG_ESP_NETIF_TCPIP_LWIP=y
# CONFIG_ESP_NETIF_LOOPBACK is not set
CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API=y
CONFIG_ESP_NETIF_REPORT_DATA_TRAFFIC=y
# CONFIG_ESP_NETIF_RECEIVE_REPORT_ERRORS is not set
CONFIG_ESP_NETIF_L2_TAP=y
CONFIG_ESP_NETIF_L2_TAP_MAX_FDS=5
CONFIG_ESP_NETIF_L2_TAP_RX_QUEUE_SIZE=20
# CONFIG_ESP_NETIF_BRIDGE_EN is not set
# CONFIG_ESP_NETIF_SET_DNS_PER_DEFAULT_NETIF is not set
# end of ESP NETIF Adapter

CONFIG_EXAMPLE_USE_INTERNAL_ETHERNET=y
CONFIG_EXAMPLE_ETH_PHY_IP101=y


#
# Ethernet
#
CONFIG_ETH_ENABLED=y
CONFIG_ETH_USE_SPI_ETHERNET=y
# CONFIG_ETH_SPI_ETHERNET_DM9051 is not set
CONFIG_ETH_SPI_ETHERNET_DM9058=y
CONFIG_ETH_DM9058_PTP_TWO_STEP_MODE=y
CONFIG_ETH_DM9058_PTP_TRANSPORT_IEEE_802_1AS=y
# CONFIG_ETH_SPI_ETHERNET_W5500 is not set
# CONFIG_ETH_SPI_ETHERNET_KSZ8851SNL is not set
# CONFIG_ETH_USE_OPENETH is not set
CONFIG_ETH_TRANSMIT_MUTEX=y
# end of Ethernet


#
# Example Configuration
#
CONFIG_ENV_GPIO_RANGE_MIN=0
CONFIG_ENV_GPIO_RANGE_MAX=48
CONFIG_ENV_GPIO_IN_RANGE_MAX=48
CONFIG_ENV_GPIO_OUT_RANGE_MAX=48
CONFIG_EXAMPLE_PTP_PULSE_GPIO=20
CONFIG_EXAMPLE_PTP_PULSE_WIDTH_NS=500000000
# end of Example Configuration

#
# PTP Daemon Configuration
#
CONFIG_NETUTILS_PTPD=y
CONFIG_NETUTILS_PTPD_CLIENT=y
CONFIG_NETUTILS_PTPD_SERVER=y
CONFIG_NETUTILS_PTPD_STACKSIZE=4096
CONFIG_NETUTILS_PTPD_SERVERPRIO=100
CONFIG_NETUTILS_PTPD_DOMAIN=0
CONFIG_NETUTILS_PTPD_IEEE_802_1AS=y
CONFIG_NETUTILS_PTPD_PDELAYREQ_INTERVAL_MS=250
CONFIG_NETUTILS_PTPD_PRIORITY1=128
CONFIG_NETUTILS_PTPD_PRIORITY2=128
CONFIG_NETUTILS_PTPD_CLASS=248
CONFIG_NETUTILS_PTPD_ACCURACY=254
CONFIG_NETUTILS_PTPD_CLOCKSOURCE=160
CONFIG_NETUTILS_PTPD_SYNC_INTERVAL_MSEC=1000
CONFIG_NETUTILS_PTPD_ANNOUNCE_INTERVAL_MSEC=10000
CONFIG_NETUTILS_PTPD_TWOSTEP_SYNC=y
CONFIG_NETUTILS_PTPD_DELAYRESP_INTERVAL=4
CONFIG_NETUTILS_PTPD_TIMEOUT_MS=60000
CONFIG_NETUTILS_PTPD_SETTIME_THRESHOLD_MS=1000
CONFIG_NETUTILS_PTPD_SEND_DELAYREQ=y
CONFIG_NETUTILS_PTPD_MAX_PATH_DELAY_NS=100000
CONFIG_NETUTILS_PTPD_DELAYREQ_AVGCOUNT=100
CONFIG_NETUTILS_PTPD_PATH_DELAY_STABILITY_NS=500
# end of PTP Daemon Configuration



#
# Example Ethernet Configuration
#
CONFIG_EXAMPLE_USE_SPI_ETHERNET=y
# (menuconfig, SPI_CONFIGURATIONS)
# CONFIG_EXAMPLE_USE_DM9051 is not set
CONFIG_EXAMPLE_USE_DM9058=y
# CONFIG_EXAMPLE_USE_KSZ8851SNL is not set
# CONFIG_EXAMPLE_USE_W5500 is not set
CONFIG_EXAMPLE_ETH_SPI_HOST=1
CONFIG_EXAMPLE_ETH_SPI_SCLK_GPIO=16
CONFIG_EXAMPLE_ETH_SPI_MOSI_GPIO=17
CONFIG_EXAMPLE_ETH_SPI_MISO_GPIO=18
CONFIG_EXAMPLE_ETH_SPI_CLOCK_MHZ=20
CONFIG_EXAMPLE_ETH_SPI_CS0_GPIO=15
CONFIG_EXAMPLE_ETH_SPI_INT0_GPIO=8
CONFIG_EXAMPLE_ETH_SPI_POLLING0_MS=0
CONFIG_EXAMPLE_ETH_SPI_PHY_RST0_GPIO=-1
CONFIG_EXAMPLE_ETH_SPI_PHY_ADDR0=1
# end of Example Ethernet Configuration
